[
  {
    "name": "Internet",
    "customers": [
      {
        "name": "Qingdao Telaidian",
        "summary": "As the biggest provider of electric car charger service in China, Qingdao Telaidian adopts TiDB as the solution for its offline computing scenario and some real-time OLAP scenarios. Currently, a single table contains nearly 2 billion rows of data with a daily increase at 8 million rows.",
        "logo": "/images/blog/customers/telaidian-logo.png"
      },
      {
        "name": "LY.com",
        "summary": "Ly.com, an online travel agency serving close to 300 million users, has deployed TiDB in multiple clusters with close to 100 nodes. The largest cluster contains more than 10 nodes handling nearly 10 TBs of data, with an average QPS of 5000 and the peak QPS of over 10000.",
        "logo": "/images/blog/customers/ly-com.png"
      },
      {
        "name": "Qunar.com",
        "summary": "As China's leading travel search engine, Qunar.com chooses TiDB as its storage and performance solution. Currently, it has deployed TiDB in the offline airline ticket cluster and the financial payment cluster, and plans to use TiDB in more application scenarios in the future.",
        "logo": "/images/blog/customers/qunar-logo.png"
      },
      {
        "name": "Jinri Toutiao",
        "summary": "Jinri Toutiao, a large news and media content platform with 120 million daily active users (DAU), is using TiDB in its core object storage system, supporting photo and video applications. TiDB works well in its high QPS scenarios, where a cluster handles dozens of TBs of data with a daily peak QPS of hundreds of thousands.",
        "logo": "/images/blog/customers/toutiao-logo.png"
      },
      {
        "name": "G7 Networks",
        "summary": "As China's leading fleet management system, G7 generates over 2 TBs of data each day and faces challenges in database transactions, analytics, scaling, and availability. Now G7 is using TiDB in its risk management data platform and is migrating more applications to TiDB.",
        "logo": "/images/blog/customers/g7-logo.png"
      },
      {
        "name": "2Dfire.com",
        "summary": "2Dfire, a major SaaS provider in the restaurant industry, is using TiDB in its real-time reporting system, which handles more than 100 million pieces of data each day, with a peak write QPS of over 4000. By using TiDB, the tech team of 2Dfire are able to focus on building its applications, without needing to worry about the problems of managing surging data.",
        "logo": "/images/blog/customers/erweihuo-logo.png"
      },
      {
        "name": "Keruyun",
        "summary": "As China's largest cloud-based SaaS company providing AI-powered catering management systems, Keruyun has deployed TiDB in its production environment to meet its online transactional processing and analytics demand.",
        "logo": "/images/blog/customers/keruyun-logo.png"
      },
      {
        "name": "Phoenix New Media",
        "summary": "IFENG.COM has been using TiDB for OLTP processing in its Phoenix New Media new content platform. The DevOps team at IFENG.COM are greatly impressed by how easy it is to scale and manage the TiDB cluster, as well as the prompt response from the professional support. More teams are interested in migrating their applications to TiDB in the future.",
        "logo": "/images/blog/customers/ifeng-logo.png"
      },
      {
        "name": "LinkDoc Technology",
        "summary": "Currently, LinkDoc is using TiDB in its two applications with the largest amount of data, with an average QPS of 6000 and a peak QPS of 12000. It plans to use TiDB to build an HTAP database platform that can process both OLTP and OLAP workloads at the same time.",
        "logo": "/images/blog/customers/linkdoc-logo.png"
      },
      {
        "name": "Yimian Data",
        "summary": "Yimian Data has deployed several TiDB nodes and dozens of TiKV nodes in its production environment, handling dozens of TBs of data. Using TiDB liberates developers from the painful operations of its previous manual sharding solution.",
        "logo": "/images/blog/customers/yimian-logo.png"
      },
      {
        "name": "Mobikok",
        "summary": "Mobikok replaces MySQL with TiDB for its SSP (Sell Side Platform) system, taking advantage of TiDB's horizontal scalability, MySQL compatibility, high availability, convenient data and traffic migration, and its mature monitoring services.",
        "logo": "/images/blog/customers/mobikok-logo.png"
      }
    ]
  },
  {
    "name": "Gaming",
    "customers": [
      {
        "name": "Seasun Games",
        "summary": "TiDB is chosen to power Seasun's real-time social media monitoring system to handle the rapid data growth and real-time interactive data analysis. Seasun Games has been using TiDB since early 2018. TiDB is handling several TBs of data and an average peak QPS of more than 3000.",
        "logo": "/images/blog/customers/seasungames-logo.png"
      },
      {
        "name": "Yoozoo Games",
        "summary": "Yoozoo Games has deployed 3 TiDB clusters so far to support 6 mission-critical OLTP scenarios since early 2017, including the user points system, login system, gift pack system, and user behavior system, with more to come.",
        "logo": "/images/blog/customers/yoozoo-logo.png"
      },
      {
        "name": "FUNYOURS JAPAN",
        "summary": "FUNYOURS JAPAN has deployed TiDB to tackle its storage and computing challenges. The adoption of TiDB reduces the total cost of ownership of the entire infrastructure and frees the game developers to focus on understanding and improving the gaming experience for our players.",
        "logo": "/images/blog/customers/funyours-japan-logo.png"
      }
    ]
  },
  {
    "name": "Financial Services",
    "customers": [
      {
        "name": "Ping++",
        "summary": "As the leading payment SaaS solution provider in China, Ping++ serves 25,000 customers across 70 industries. Ping++ chooses TiDB as its real-time data warehouse solution because TiDB breaks the separation between OLTP and OLAP and provides a scalable Hybrid Transactional and Analytical Processing (HTAP) database. It also provides industry-standard security features to support financial services.",
        "logo": "/images/blog/customers/ping++-logo.png"
      },
      {
        "name": "360 Finance",
        "summary": "360 Finance has been using TiDB in its real-time risk management scenario. Average TPS is around 5000 and the computing capability during peak hours has improved by up to 10 times with stable throughput and response time. Risk management analysts can now use familiar SQL to access real-time data and make informed decisions more quickly.",
        "logo": "/images/blog/customers/360-financial-logo.png"
      }
    ]
  }
]
